In [2]:
import pandas as pd

In [3]:
# Load the uploaded CSV file
file_path = "E:/Users/Documents/College/Engineering/S.Y. Eng/Sem 4/PBL/archive/Balaji Fast Food Sales - Copy.csv"
df = pd.read_csv(file_path)

In [4]:
df.head()

,order_id,timestamp,item_name,item_type,item_price,quantity,transaction_amount,transaction_type,received_by,time_of_sale
0,1,07-03-2022,Aalopuri,Fastfood,20,13,260,NaN,Mr.,Night
1,2,8/23/2022,Vadapav,Fastfood,20,15,300,Cash,Mr.,Afternoon
2,3,11/20/2022,Vadapav,Fastfood,20,1,20,Cash,Mr.,Afternoon
3,4,02-03-2023,Sugarcane juice,Beverages,25,6,150,Online,Mr.,Night
4,5,10-02-2022,Sugarcane juice,Beverages,25,8,200,Online,Mr.,Evening

In [5]:
def clean_timestamp(date_str):
    try:
        return pd.to_datetime(date_str, errors='coerce', dayfirst=False)
    except Exception:
        return None

In [6]:
df['timestamp'] = df['timestamp'].apply(clean_timestamp)

In [7]:
time_mapping = {
    "Morning": "08:00:00",
    "Afternoon": "14:00:00",
    "Evening": "18:00:00",
    "Night": "22:00:00"
}

In [8]:
df['time_of_sale'] = df['time_of_sale'].map(time_mapping)

In [9]:
df['timestamp'] = df['timestamp'].astype(str) + " " + df['time_of_sale'].astype(str)
df['timestamp'] = pd.to_datetime(df['timestamp'], errors='coerce')

In [10]:
df = df.drop(columns=['time_of_sale'])

In [11]:
df.head()

,order_id,timestamp,item_name,item_type,item_price,quantity,transaction_amount,transaction_type,received_by
0,1,2022-07-03 22:00:00,Aalopuri,Fastfood,20,13,260,NaN,Mr.
1,2,2022-08-23 14:00:00,Vadapav,Fastfood,20,15,300,Cash,Mr.
2,3,2022-11-20 14:00:00,Vadapav,Fastfood,20,1,20,Cash,Mr.
3,4,2023-02-03 22:00:00,Sugarcane juice,Beverages,25,6,150,Online,Mr.
4,5,2022-10-02 18:00:00,Sugarcane juice,Beverages,25,8,200,Online,Mr.

In [12]:
df.to_csv('sample_data.csv')